set reportDir reports


# create directory in does not exists
if {[expr ! [file exists $reportDir]]} { file mkdir $reportDir }

# read the Innovus database saved in the last PR stage
# TODO: check the Innovus database path
read_db ../asic/pr/saved/mtm_riscv_chip_15_final.db

# set which analysis views are used for power reporting
set_analysis_view -dynamic BC_av -leakage BC_av -setup WC_av -hold BC_av


# reset activity data
reset_power_activity

# read the activity file generated by post-layout simulation
# TODO: check the file path
read_activity_file ../sim/post_layout/mtm_riscv_chip.tcf.gz \
  -format TCF \
  -scope u_mtm_riscv_chip

# check if the annotation was correct
report_unannotated_nets \
  -type tcf \
  -file $reportDir/tcf_unannotated_nets.rpt
# TODO: check the report content. It should indicate:
# Annotation results: */* = 100%


# generate power reports
report_power \
  -out_dir $reportDir \
  -report_prefix "pwr" \
  -format simple

report_power \
  -out_dir $reportDir \
  -report_prefix "pwr_detail" \
  -format detailed \
  -cell_type all
# TODO: your result is "Total power" in the report

exit
